cmsis-svd/cmsis-svd/data/Microchip/ATSAMG51.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <description>Nested Vectored Interrupt Controller</description>
         <groupName>NVIC</groupName>
         <prependToName>NVIC_</prependToName>
         <baseAddress>0xE000E100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE04</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>NVICISER0</name>
               <description>Interrupt Set Enable Register n</description>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISER1</name>
               <description>Interrupt Set Enable Register n</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISER2</name>
               <description>Interrupt Set Enable Register n</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISER3</name>
               <description>Interrupt Set Enable Register n</description>
               <addressOffset>0x0000000c</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICER0</name>
               <description>Interrupt Clear Enable Register n</description>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICER1</name>
               <description>Interrupt Clear Enable Register n</description>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICER2</name>
               <description>Interrupt Clear Enable Register n</description>
               <addressOffset>0x00000088</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICER3</name>
               <description>Interrupt Clear Enable Register n</description>
               <addressOffset>0x0000008c</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISPR0</name>
               <description>Interrupt Set Pending Register n</description>
               <addressOffset>0x00000100</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISPR1</name>
               <description>Interrupt Set Pending Register n</description>
               <addressOffset>0x00000104</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISPR2</name>
               <description>Interrupt Set Pending Register n</description>
               <addressOffset>0x00000108</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICISPR3</name>
               <description>Interrupt Set Pending Register n</description>
               <addressOffset>0x0000010c</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICPR0</name>
               <description>Interrupt Clear Pending Register n</description>
               <addressOffset>0x00000180</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICPR1</name>
               <description>Interrupt Clear Pending Register n</description>
               <addressOffset>0x00000184</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICPR2</name>
               <description>Interrupt Clear Pending Register n</description>
               <addressOffset>0x00000188</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICICPR3</name>
               <description>Interrupt Clear Pending Register n</description>
               <addressOffset>0x0000018c</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIABR0</name>
               <description>Interrupt Active bit Register n</description>
               <addressOffset>0x00000200</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Interrupt active flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIABR1</name>
               <description>Interrupt Active bit Register n</description>
               <addressOffset>0x00000204</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Interrupt active flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIABR2</name>
               <description>Interrupt Active bit Register n</description>
               <addressOffset>0x00000208</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Interrupt active flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIABR3</name>
               <description>Interrupt Active bit Register n</description>
               <addressOffset>0x0000020c</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Interrupt active flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP0</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000300</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI0</name>
                     <description>Priority of interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP1</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000301</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI1</name>
                     <description>Priority of interrupt 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP2</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000302</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI2</name>
                     <description>Priority of interrupt 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP3</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000303</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI3</name>
                     <description>Priority of interrupt 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP4</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000304</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI4</name>
                     <description>Priority of interrupt 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP5</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000305</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI5</name>
                     <description>Priority of interrupt 5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP6</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000306</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI6</name>
                     <description>Priority of interrupt 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP7</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000307</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI7</name>
                     <description>Priority of interrupt 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP8</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000308</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI8</name>
                     <description>Priority of interrupt 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP9</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000309</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI9</name>
                     <description>Priority of interrupt 9</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP10</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000030a</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI10</name>
                     <description>Priority of interrupt 10</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP11</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000030b</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI11</name>
                     <description>Priority of interrupt 11</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP12</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000030c</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI12</name>
                     <description>Priority of interrupt 12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP13</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000030d</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI13</name>
                     <description>Priority of interrupt 13</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP14</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000030e</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI14</name>
                     <description>Priority of interrupt 14</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP15</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x0000030f</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI15</name>
                     <description>Priority of interrupt 15</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP16</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000310</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI16</name>
                     <description>Priority of interrupt 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP17</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000311</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI17</name>
                     <description>Priority of interrupt 17</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NVICIP18</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x00000312</addressOffset>
               <size>8</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>PRI18</name>
                     <description>Priority of interrupt 18</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
